app/views/productos/_form.html.erb

        <%= f.label :marca %><br>
        <%= f.collection_select :marca_id, Marca.all, :id, :nombre, :prompt => "Seleccione la marca", :class => "dropdown-menu" %>
---
SELECT "marcas".* FROM "marcas"