app/views/productos/index.html.erb

    </div>
    <h4>Suma total de precios: $<%= Producto.sum(:precio) %></h4>
---
SELECT "productos".* FROM "productos"
SELECT SUM("productos"."precio") FROM "productos"