app/controllers/brands_controller.rb

	def show
    	@brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
  		@brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def create
		@brand = Brand.new(brand_params)

		if @brand.save
---
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Apple"], ["created_at", "2017-08-03 18:43:06.101326"], ["updated_at", "2017-08-03 18:43:06.101326"]]

	def update
  		@brand = Brand.find(params[:id])

  		if @brand.update(brand_params)
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "brands" SET "name" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "Samsung x"], ["updated_at", "2017-08-03 18:52:36.367007"], ["id", 2]]

	def destroy
  		@brand = Brand.find(params[:id])
  		@brand.destroy
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 3]]