app/controllers/marcas_controller.rb

 	def index
 	    @marcas = Marca.all
---
SELECT "marcas".* FROM "marcas"

	def show
    	@marca = Marca.find(params[:id])
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

	def edit
  		@marca = Marca.find(params[:id])
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

	def create
		@marca = Marca.new(marca_params)

		if @marca.save
---
INSERT INTO "marcas" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "playeras"], ["created_at", "2017-08-02 20:42:35.043458"], ["updated_at", "2017-08-02 20:42:35.043458"]]

	def update
  		@marca = Marca.find(params[:id])

  		if @marca.update(marca_params)
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "marcas" SET "nombre" = ?, "updated_at" = ? WHERE "marcas"."id" = ?  [["nombre", "LGs"], ["updated_at", "2017-08-03 00:54:46.571136"], ["id", 16]]

	def destroy
  		@marca = Marca.find(params[:id])
  		@marca.destroy
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "marcas" WHERE "marcas"."id" = ?  [["id", 16]]