app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["price", 100], ["created_at", "2017-08-03 19:10:47.374967"], ["updated_at", "2017-08-03 19:10:47.374967"]]
---
	def create
		@product = Product.new(product_params)

		if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Iphone 8"], ["description", "Iphone 8 con 4 gb de memoria RAM"], ["updated_at", "2017-08-03 23:16:13.622808"], ["id", 9]]
---
	def update
  		@product = Product.find(params[:id])

  		if @product.update(product_params)