app/controllers/productos_controller.rb

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def show
    	@producto = Producto.find(params[:id])

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
	def edit
		@producto = Producto.find(params[:id])

INSERT INTO "productos" ("nombre", "descripcion", "precio", "marca_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "lap"], ["descripcion", "grande"], ["precio", 3], ["marca_id", 2], ["created_at", "2017-08-02 20:39:50.854875"], ["updated_at", "2017-08-02 20:39:50.854875"]]
---
	def create
		@producto = Producto.new(producto_params)

		if @producto.save

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "productos" SET "nombre" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["nombre", "Mac Air s"], ["updated_at", "2017-08-03 00:57:50.170197"], ["id", 8]]
---
	def update
  		@producto = Producto.find(params[:id])

  		if @producto.update(producto_params)

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 12]]
---
	def destroy
  		@producto = Producto.find(params[:id])
  		@producto.destroy