app/views/products/_form.html.erb

        <%= f.label :marca %><br>
        <%= f.collection_select :brand_id, Brand.all, :id, :name, :prompt => "Seleccione la marca", :class => "dropdown-menu" %>
---
SELECT "brands".* FROM "brands"