app/views/products/index.html.erb

    </div>
    <h4>Suma total de precios: $<%= Product.sum(:price) %></h4>
---
SELECT "products".* FROM "products"
SELECT SUM("products"."price") FROM "products"